Repository: Khalidbinwaheed/Ramdanplanner
Catalog: lib/l10n/app_*.arb
Languages: ar, ur

# termsOfServiceContent
source: Terms & Conditions Last Updated: February 22, 2026 App Name: Ramadan Planner 1. Acceptance of Terms By accessing or using the Ramadan Planner mobile application (“App”), you agree to comply with these Terms & Conditions. If you do not agree, please discontinue use of the App. 2. Use of the App The App provides prayer times, Azan notifications, Quran features, tasbeeh counter, dua collection, and Ramadan tracking tools for personal and spiritual use only. You agree to use the App lawfully and responsibly. 3. User Responsibility Users are responsible for: Providing accurate information, Maintaining account security, Verifying prayer times with local authorities when necessary. The App does not replace religious scholars or official mosque announcements. 4. Location & Accuracy Prayer times are calculated based on selected location and chosen calculation methods. Minor variations may occur. We are not liable for inaccuracies caused by device, GPS, or technical limitations. 5. Intellectual Property All content, design, branding, and features within the App are the property of Ramadan Planner and may not be copied, modified, or distributed without permission. 6. Limitation of Liability The App is provided “as is” without warranties. We are not responsible for missed notifications, device malfunctions, data loss, or service interruptions. 7. Privacy Use of the App is also governed by our Privacy Policy. 8. Modifications We reserve the right to update these Terms or modify the App at any time. Continued use of the App constitutes acceptance of any changes. 9. Governing Law These Terms shall be governed by the laws of Pakistan. 10. Contact For inquiries, please contact: email : codecrypticalitinnovators@gmail.com website : codecraftpk.com
ar: الشروط والأحكام آخر تحديث: 22 فبراير 2026 اسم التطبيق: مخطط رمضان 1. قبول الشروط من خلال الوصول إلى تطبيق الجوال 'مخطط رمضان' (التطبيق) أو استخدامه، فإنك توافق على الالتزام بهذه الشروط والأحكام. إذا كنت لا توافق، يرجى التوقف عن استخدام التطبيق. 2. استخدام التطبيق يوفر التطبيق أوقات الصلاة، وتنبيهات الأذان، وميزات القرآن، وعداد التسبيح، ومجموعة الأدعية، وأدوات تتبع رمضان للاستخدام الشخصي والروحي فقط. أنت توافق على استخدام التطبيق بشكل قانوني ومسؤول. 3. مسؤولية المستخدم المستخدمون مسؤولون عن: تقديم معلومات دقيقة، والحفاظ على أمن الحساب، والتحقق من أوقات الصلاة مع السلطات المحلية عند الضرورة. لا يحل التطبيق محل علماء الدين أو الإعلانات الرسمية للمساجد. 4. الموقع والدقة يتم حساب أوقات الصلاة بناءً على الموقع المحدد وطرق الحساب المختارة. قد تحدث اختلافات طفيفة. نحن غير مسؤولين عن أي عدم دقة ناتج عن الجهاز أو نظام تحديد المواقع (GPS) أو القيود التقنية. 5. الملكية الفكرية جميع المحتويات والتصاميم والعلامات التجارية والميزات داخل التطبيق هي ملك لـ 'مخطط رمضان' ولا يجوز نسخها أو تعديلها أو توزيعها دون إذن. 6. تحديد المسؤولية يتم توفير التطبيق 'كما هو' دون ضمانات. نحن غير مسؤولين عن التنبيهات الفائتة، أو أعطال الجهاز، أو فقدان البيانات، أو انقطاع الخدمة. 7. الخصوصية يخضع استخدام التطبيق أيضاً لسياسة الخصوصية الخاصة بنا. 8. التعديلات نحتفظ بالحق في تحديث هذه الشروط أو تعديل التطبيق في أي وقت. إن استمرارك في استخدام التطبيق يشكل قبولاً لأي تغييرات. 9. القانون الحاكم خضع هذه الشروط لقوانين باكستان. 10. الاتصال للاستفسارات، يرجى الاتصال بـ: البريد الإلكتروني: codecrypticalitinnovators@gmail.com الموقع الإلكتروني: codecraftpk.com
ur: شرائط و ضوابط آخری اپ ڈیٹ: 22 فروری 2026 ایپ کا نام: رمضان پلانر 1. شرائط کی قبولیت رمضان پلانر موبائل ایپلیکیشن (ایپ) تک رسائی حاصل کرکے یا اسے استعمال کرکے، آپ ان شرائط و ضوابط کی تعمیل کرنے پر اتفاق کرتے ہیں۔ اگر آپ متفق نہیں ہیں تو، براہ کرم ایپ کا استعمال بند کردیں۔ 2. ایپ کا استعمال ایپ صرف ذاتی اور نجی استعمال کے لیے نماز کے اوقات، اذان کی اطلاعات، قرآن کی خصوصیات، تسبیح کاؤنٹر، دعاؤں کا مجموعہ، اور رمضان ٹریکنگ ٹولز فراہم کرتی ہے۔ آپ ایپ کو قانونی اور ذمہ دارانہ طور پر استعمال کرنے پر اتفاق کرتے ہیں۔ 3. صارف کی ذمہ داری صارفین ذمہ دار ہیں: درست معلومات فراہم کرنے کے، اکاؤنٹ کی سیکیورٹی برقرار رکھنے کے، اور ضرورت پڑنے پر مقامی حکام کے ساتھ نماز کے اوقات کی تصدیق کرنے کے۔ ایپ مذہبی اسکالرز یا مساجد کے سرکاری اعلانات کا متبادل نہیں ہے۔ 4. مقام اور درستگی نماز کے اوقات کا حساب منتخب مقام اور منتخب کردہ حسابی طریقوں کی بنیاد پر کیا جاتا ہے۔ معمولی فرق ہو سکتا ہے۔ ہم ڈیوائس، جی پی ایس، یا تکنیکی حدود کی وجہ سے ہونے والی غلطیوں کے ذمہ دار نہیں ہیں۔ 5. دانشورانہ ملکیت ایپ کے اندر موجود تمام مواد، ڈیزائن، برانڈنگ اور خصوصیات رمضان پلانر کی ملکیت ہیں اور اجازت کے بغیر کاپی، ترمیم یا تقسیم نہیں کی جا سکتیں۔ 6. ذمہ داری کی حد ایپ 'جیسا ہے' کی بنیاد پر فراہم کی گئی ہے۔ ہم چھوٹی ہوئی اطلاعات، ڈیوائس کی خرابی، ڈیٹا کے ضیاع، یا سروس میں خلل کے ذمہ دار نہیں ہیں۔ 7. رازداری ایپ کا استعمال ہماری پرائیویسی پالیسی کے تابع بھی ہے۔ 8. ترامیم ہم کسی بھی وقت ان شرائط کو اپ ڈیٹ کرنے یا ایپ میں ترمیم کرنے کا حق محفوظ رکھتے ہیں۔ ایپ کا مسلسل استعمال کسی بھی تبدیلی کی قبولیت تصور کیا جائے گا۔ 9. متعلقہ قانون یہ شرائط پاکستان کے قوانین کے تابع ہوں گی۔ 10. رابطہ پوچھ گچھ کے لیے، براہ کرم رابطہ کریں: ای میل: codecrypticalitinnovators@gmail.com ویب سائٹ: codecraftpk.com

source: Privacy Policy
ar: سياسة الخصوصية
ur: پرائیویسی پالیسی

# privacyPolicyContent
source: We respect your privacy. We only use your name and location to help you get correct prayer times and track your Ramadan goals. We never sell your data. You can delete your data anytime.
ar: نحن نحترم خصوصيتك. نحن نستخدم اسمك وموقعك فقط لمساعدتك في الحصول على أوقات صلاة صحيحة وتتبع أهدافك الرمضانية. نحن لا نبيع بياناتك أبداً. يمكنك حذف بياناتك في أي وقت.
ur: ہم آپ کی رازداری کا احترام کرتے ہیں۔ ہم آپ کا نام اور مقام صرف آپ کو نماز کے درست اوقات بتانے اور آپ کے رمضان کے اہداف کو ٹریک کرنے میں مدد کے لیے استعمال کرتے ہیں۔ ہم آپ کا ڈیٹا کبھی فروخت نہیں کرتے۔ آپ کسی بھی وقت اپنا ڈیٹا حذف کر سکتے ہیں۔

source: Ramadan Goals
ar: أهداف رمضان
ur: رمضان کے اہداف

source: Total Goals
ar: إجمالي الأهداف
ur: کل اہداف

# goalsCompleted
source: Completed
ar: المكتملة
ur: مکمل شدہ

# goalsInProgress
source: In Progress
ar: قيد التنفيذ
ur: جاری ہے

source: Add Custom Goal
ar: إضافة هدف مخصص
ur: نیا ہدف شامل کریں

source: Goal title
ar: عنوان الهدف
ur: ہدف کا عنوان

# goalHint
source: e.g. Read 100 pages
ar: مثال: قراءة 100 صفحة
ur: مثلا: 100 صفحات پڑھیں

source: Target
ar: الهدف
ur: ہدف

# goalProgress
source: Progress
ar: التقدم
ur: پیش رفت

# goalCompletedMsg
source: Goal Completed! Alhamdulillah!
ar: تم اكتمال الهدف! الحمد لله!
ur: ہدف مکمل! الحمد للہ!

# goalQuran
source: Finish the Holy Quran
ar: ختم القرآن الكريم
ur: قرآن مجید مکمل کریں

# goalPrayers
source: Pray 5 times daily
ar: صلاة 5 فروض يومياً
ur: روزانہ 5 وقت نماز پڑھیں

# goalSadaqah
source: Give charity (sadaqah)
ar: إخراج الصدقة
ur: صدقہ دیں

# goalDua
source: Learn 10 special duas
ar: تعلم 10 أدعية خاصة
ur: 10 خصوصی دعائیں یاد کریں

# goalFast
source: Fast all 30 days
ar: صيام 30 يوماً كاملة
ur: تمام 30 روزے رکھیں

# goalTaraweeh
source: Pray Taraweeh
ar: صلاة التراويح
ur: تراویح پڑھیں

source: Badges
ar: الأوسمة
ur: بیجز
