Repository: Khalidbinwaheed/Ramdanplanner
Catalog: lib/l10n/app_*.arb
Languages: ar, ur

# appName
source: Ramadan Planner
ar: مخطط رمضان
ur: رمضان پلانر

source: Settings
ar: الإعدادات
ur: ترتیبات

source: Theme
ar: المظهر
ur: تھیم

source: Light
ar: فاتح
ur: لائٹ

source: Dark
ar: داكن
ur: ڈارک

source: System
ar: النظام
ur: سسٹم

source: Language
ar: اللغة
ur: زبان

source: Prayer Times
ar: أوقات الصلاة
ur: نماز کے اوقات

source: Fajr
ar: الفجر
ur: فجر

source: Sunrise
ar: الشروق
ur: طلوع آفتاب

source: Dhuhr
ar: الظهر
ur: ظہر

source: Asr
ar: العصر
ur: عصر

source: Maghrib
ar: المغرب
ur: مغرب

source: Isha
ar: العشاء
ur: عشاء

source: Ibadah Checklist
ar: قائمة العبادات
ur: عبادت کی فہرست

# didYouFast
source: Did you fast today?
ar: هل صمت اليوم؟
ur: کیا آپ نے آج روزہ رکھا؟

source: Prayers
ar: الصلوات
ur: نمازیں

source: Adhkar
ar: الأذكار
ur: اذکار

source: City
ar: المدينة
ur: شہر

# cityHint
source: e.g. Peshawar
ar: مثال: مكة المكرمة
ur: مثال: پشاور

source: Latitude
ar: خط العرض
ur: عرض بلد

source: Longitude
ar: خط الطول
ur: طول بلد

source: Detect My Location
ar: تحديد موقعي
ur: میرا مقام معلوم کریں

source: Calculation Method
ar: طريقة الحساب
ur: حساب کا طریقہ

# calculationMethodKarachi
source: University of Islamic Sciences, Karachi
ar: جامعة العلوم الإسلامية، كراتشي
ur: جامعہ علوم اسلامیہ، کراچی

# calculationMethodISNA
source: Islamic Society of North America
ar: الجمعية الإسلامية لأمريكا الشمالية
ur: اسلامک سوسائٹی آف نارتھ امریکہ

# calculationMethodMWL
source: Muslim World League
ar: رابطة العالم الإسلامي
ur: مسلم ورلڈ لیگ

# calculationMethodMakkah
source: Umm Al-Qura University, Makkah
ar: جامعة أم القرى، مكة المكرمة
ur: ام القری یونیورسٹی، مکہ مکرمہ

# calculationMethodEgypt
source: Egyptian General Authority of Survey
ar: الهيئة المصرية العامة للمساحة
ur: مصری جنرل اتھارٹی آف سروے

source: School
ar: المذهب
ur: مسلک

# schoolStandard
source: Shafi'i / Maliki / Hanbali
ar: شافعي / مالكي / حنبلي
ur: شافعی / مالكي / حنبلی

# schoolHanafi
source: Hanafi
ar: حنفي
ur: حنفی

# languageEnglish
source: English
ar: الإنجليزية
ur: انگریزی

# languageArabic
source: Arabic
ar: العربية
ur: عربی

# languageUrdu
source: Urdu
ar: الأردية
ur: اردو

source: Currency
ar: العملة
ur: کرنسی

source: Taraweeh
ar: التراويح
ur: تراویح

source: Qur'an Tilawat
ar: تلاوة القرآن
ur: قرآن کی تلاوت

source: Islamic Study
ar: درس إسلامي
ur: اسلامی مطالعہ

source: Morning/Evening Adhkar
ar: أذكار الصباح والمساء
ur: صبح و شام کے اذکار

# surahMulk
source: Surah Al-Mulk
ar: سورة الملك
ur: سورۃ الملک

source: Istighfar
ar: الاستغفار
ur: استغفار

source: Durood
ar: الصلاة على النبي
ur: درود شریف

source: SubhanAllah
ar: سبحان الله
ur: سبحان اللہ

source: Sadaqah
ar: الصدقة
ur: صدقہ

source: Add Custom Item
ar: إضافة بند مخصص
ur: اپنی طرف سے شامل کریں

source: Fard
ar: فرض
ur: فرض

source: Sunnah
ar: سنة
ur: سنت

source: Jamah
ar: جماعة
ur: جماعت

source: Streak
ar: تتابع
ur: مسلسل

source: Days Full
ar: أيام كاملة
ur: مکمل دن

source: Update
ar: تحديث
ur: اپ ڈیٹ

source: Cancel
ar: إلغاء
ur: منسوخ

source: Save
ar: حفظ
ur: محفوظ

# valueLabel
source: Value
ar: القيمة
ur: قیمت

source: Day
ar: يوم
ur: دن

source: Ashra
ar: عشرة
ur: عشرہ

source: Overall
ar: إجمالي
ur: مجموعی

# greeting
source: Assalam O Alikum
ar: السلام عليكم
ur: السلام علیکم

# guestUser
source: User
ar: مستخدم
ur: صارف

source: Name
ar: الاسم
ur: نام

# enterName
source: Enter your name
ar: أدخل اسمك
ur: اپنا نام درج کریں

source: Hijri
ar: هجري
ur: ہجری

source: Loading...
ar: جار التحميل...
ur: لوڈ ہو رہا ہے...

# errorDate
source: Error loading date
ar: خطأ في تحميل التاريخ
ur: تاریخ لوڈ کرنے میں خرابی

source: Save Progress
ar: حفظ التقدم
ur: پیش رفت محفوظ کریں

source: Reset Day?
ar: إعادة تعيين اليوم؟
ur: دن کو دوبارہ ترتیب دیں؟

# resetDayContent
source: Are you sure you want to reset Day {day}? All progress for this day will be lost.
ar: هل أنت متأكد أنك تريد إعادة تعيين اليوم {day}؟ سيتم فقد كل التقدم لهذا اليوم.
ur: کیا آپ واقعی دن {day} کو دوبارہ ترتیب دینا چاہتے ہیں؟ اس دن کی تمام پیش رفت ضائع ہو جائے گی۔

source: Reset
ar: إعادة تعيين
ur: ری سیٹ کریں

source: Tasbih Name
ar: اسم التسبيح
ur: تسبیح کا نام

# tasbihNameHint
source: e.g. SubhanAllah
ar: مثال: سبحان الله
ur: مثال: سبحان اللہ

source: Edit
ar: تعديل
ur: ترمیم

source: Evening Reflection
ar: انعكاس المساء
ur: شام کا محاسبہ

# reflectionBest
source: Best Moment
ar: أفضل لحظة
ur: بہترین لمحہ

# reflectionShortfall
source: What I fell short in
ar: ما قصرت فيه
ur: کوتاہی

# reflectionSpecial
source: Special dua I made
ar: دعاء خاص دعوت به
ur: خاص دعا

# reflectionGratitude
source: One thing I'm grateful for
ar: شيء واحد أنا ممتن له
ur: شکرگزاری

# resetAllDataTitle
source: Reset All Data?
ar: إعادة تعيين جميع البيانات؟
ur: تمام ڈیٹا کو دوبارہ ترتیب دیں؟

# resetAllDataContent
source: This will delete all your trackers, duas, and settings. This action cannot be undone.
ar: سيؤدي هذا إلى حذف جميع المتتبعات والأدعية والإعدادات الخاصة بك. لا يمكن التراجع عن هذا الإجراء.
ur: یہ آپ کے تمام ٹریکرز، دعاؤں اور ترتیبات کو حذف کر دے گا۔ یہ عمل واپس نہیں کیا جا سکتا۔

# resetAppData
source: Reset All Progress
ar: عادة تعيين كل التقدم
ur: تمام پیش رفت ری سیٹ کریں

# locationDisabled
source: Location services are disabled.
ar: خدمات الموقع معطلة.
ur: مقام کی خدمات غیر فعال ہیں۔

# locationPermissionDenied
source: Location permissions are denied
ar: تم رفض أذونات الموقع
ur: مقام کی اجازت مسترد کر دی گئی

# locationPermissionPermanent
source: Location permissions are permanently denied.
ar: تم رفض أذونات الموقع بشكل دائم.
ur: مقام کی اجازت مستقل طور پر مسترد کر دی گئی ہے۔

source: Detecting location...
ar: جار الكشف عن الموقع...
ur: مقام کا پتہ لگایا جا رہا ہے...

# locationError
source: Error detecting location: {error}
ar: خطأ في الكشف عن الموقع: {error}
ur: مقام کا پتہ لگانے میں خرابی: {error}

# settingsSaved
source: Settings saved successfully
ar: تم حفظ الإعدادات بنجاح
ur: ترتیبات کامیابی سے محفوظ ہو گئیں

# allDataReset
source: All data has been reset.
ar: تم إعادة تعيين جميع البيانات.
ur: تمام ڈیٹا کو دوبارہ ترتیب دے دیا گیا ہے۔

# dayTitle
source: Day {day}
ar: اليوم {day}
ur: دن {day}

# ashra1
source: 1st Ashra (Mercy)
ar: العشرة الأولى (الرحمة)
ur: پہلا عشرہ (رحمت)

# ashra2
source: 2nd Ashra (Forgiveness)
ar: العشرة الثانية (المغفرة)
ur: دوسرا عشرہ (مغفرت)

# ashra3
source: 3rd Ashra (Freedom)
ar: العشرة الثالثة (العتق)
ur: تیسرا عشرہ (نجات)

# ashraTitle
source: Ashra
ar: عشرة
ur: عشرة

# ashra1Title
source: 1st Ashra
ar: العشرة الأولى
ur: پہلا عشرہ

# ashra1Subtitle
source: Mercy
ar: الرحمة
ur: رحمت

# ashra2Title
source: 2nd Ashra
ar: العشرة الثانية
ur: دوسرا عشرہ

# ashra2Subtitle
source: Forgiveness
ar: المغفرة
ur: مغفرت

# ashra3Title
source: 3rd Ashra
ar: العشرة الثالثة
ur: تیسرا عشرہ

# ashra3Subtitle
source: Freedom
ar: العتق من النار
ur: نجات

# about
source: About App
ar: عن التطبيق
ur: ایپ کے بارے میں

source: Developer
ar: المطور
ur: ڈویلپر

source: Company
ar: الشركة
ur: کمپنی

# appDescription
source: About Ramadan Planner Ramadan Planner is a thoughtfully designed mobile application created to help Muslims organize, track, and enhance their spiritual journey during the holy month of Ramadan. The app provides essential tools such as prayer time notifications, Azan alarms, Quran reading features, tasbeeh counter, dua collection, and daily routine tracking to support users in maintaining consistency and focus. This application was designed and developed under the supervision and leadership of Khalid bin Waheed, who served as the Lead of the project team. From concept planning and feature structuring to design direction and implementation oversight, the app was built under his direct guidance to ensure quality, usability, and spiritual value. The vision behind Ramadan Planner is to combine technology with faith in a simple, user-friendly, and meaningful way making Ramadan more organized, productive, and spiritually rewarding for everyone. Our Mission To provide a reliable, easy-to-use digital companion that supports Muslims in strengthening their faith and daily worship during Ramadan and beyond.
ar: حول مخطط رمضان مخطط رمضان هو تطبيق جوال مصمم بعناية لمساعدة المسلمين على تنظيم وتتبع وتعزيز رحلتهم الروحية خلال شهر رمضان المبارك. يوفر التطبيق أدوات أساسية مثل تنبيهات أوقات الصلاة، وتنبيهات الأذان، وميزات قراءة القرآن، وعداد التسبيح، ومجموعة الأدعية، وتتبع الروتين اليومي لمساعدة المستخدمين في الحفاظ على الاتساق والتركيز. تم تصميم وتطوير هذا التطبيق تحت إشراف وقيادة خالد بن وحيد، الذي شغل منصب قائد فريق المشروع. من تخطيط المفهوم وهيكلة الميزات إلى توجيه التصميم والإشراف على التنفيذ، تم بناء التطبيق تحت توجيهه المباشر لضمان الجودة وسهولة الاستخدام والقيمة الروحية. تتمثل الرؤية وراء مخطط رمضان في الجمع بين التكنولوجيا والإيمان بطريقة بسيطة وسهلة الاستخدام وهادفة، مما يجعل رمضان أكثر تنظيماً وإنتاجية ومجزياً روحياً للجميع. مهمتنا توفير رفيق رقمي موثوق وسهل الاستخدام يدعم المسلمين في تعزيز إيمانهم وعبادتهم اليومية خلال شهر رمضان وما بعده.
ur: رمضان پلانر کے بارے میں رمضان پلانر ایک سوچ سمجھ کر ڈیزائن کی گئی موبائل ایپلیکیشن ہے جو مسلمانوں کو ماہ رمضان کے دوران اپنے روحانی سفر کو منظم کرنے، ٹریک کرنے اور اسے بہتر بنانے میں مدد کرنے کے لیے بنائی گئی ہے۔ ایپ نماز کے اوقات کی اطلاعات، اذان کے الارم، قرآن پڑھنے کے فیچرز، تسبیح کاؤنٹر، دعا کلیکشن، اور روزانہ کے معمولات کی ٹریکنگ جیسے ضروری ٹولز فراہم کرتی ہے تاکہ صارفین کو توجہ برقرار رکھنے میں مدد ملے۔ یہ ایپلیکیشن خالد بن وحید کی نگرانی اور قیادت میں ڈیزائن اور تیار کی گئی ہے، جنہوں نے پروجیکٹ ٹیم کے لیڈ کے طور پر خدمات انجام دیں۔ تصوراتی منصوبہ بندی اور خصوصیات کی ساخت سے لے کر ڈیزائن کی سمت اور عمل درآمد کی نگرانی تک، ایپ ان کی براہ راست رہنمائی میں معیار، افادیت اور روحانی قدر کو یقینی بنانے کے لیے بنائی گئی تھی۔ رمضان پلانر کے پیچھے وژن ٹیکنالوجی اور ایمان کو ایک سادہ، صارف دوست اور بامعنی انداز میں یکجا کرنا ہے جس سے رمضان ہر ایک کے لیے زیادہ منظم، نتیجہ خیز اور روحانی طور پر فائدہ مند بن سکے۔ ہمارا مشن ایک قابل اعتماد، استعمال میں آسان ڈیجیٹل ساتھی فراہم کرنا جو رمضان کے دوران اور اس کے بعد مسلمانوں کے ایمان اور روزانہ کی عبادت کو مضبوط کرنے میں ان کی مدد کرے۔

source: Version
ar: الإصدار
ur: ورژن

source: Profile
ar: الملف الشخصي
ur: پروفائل

source: User Name
ar: اسم المستخدم
ur: صارف کا نام

source: Email Address (Optional)
ar: عنوان البريد الإلكتروني (اختياري)
ur: ای میل ایڈریس (اختیاری)

source: Age (Optional)
ar: العمر (اختياري)
ur: عمر (اختیاری)

# locationAndPrayer
source: Location & Prayer
ar: الموقع والصلاة
ur: مقام اور نماز

source: City Name
ar: اسم المدينة
ur: شہر کا نام

source: Time Format
ar: تنسيق الوقت
ur: وقت کا فارمیٹ

# hour12
source: 12 Hour
ar: 12 ساعة
ur: 12 گھنٹے

# hour24
source: 24 Hour
ar: 24 ساعة
ur: 24 گھنٹے

source: Auto-Detect GPS
ar: تحديد الموقع تلقائياً
ur: خودکار مقام (GPS)

source: GPS Updated
ar: تم تحديث الموقع
ur: مقام اپ ڈیٹ ہو گیا

source: Appearance
ar: المظهر
ur: ظاہری شکل

source: App Theme
ar: مظهر التطبيق
ur: تھیم

source: Light Mode
ar: الوضع الفاتح
ur: لائٹ موڈ

source: Dark Mode
ar: الوضع الداكن
ur: ڈارک موڈ

source: System Default
ar: افتراضي النظام
ur: سسٹم ڈیفالٹ

source: App Language
ar: لغة التطبيق
ur: ایپ کی زبان

source: Enable Animations
ar: تفعيل الحركات
ur: اینیمیشن فعال کریں

# fontScale
source: Font Scale: {scale}x
ar: حجم الخط: {scale}x
ur: فونٹ سکیل: {scale}x

source: Notifications
ar: التنبيهات
ur: اطلاعات

source: Reminder Preferences
ar: تفضيلات التذكير
ur: یاد دہانی کی ترجیحات

# reminderSuffix
source: Reminder
ar: تذكير
ur: یاد دہانی

source: Notification Style
ar: نمط التنبيه
ur: اطلاع کا انداز

# dataAndPrivacy
source: Data & Privacy
ar: البيانات والخصوصية
ur: ڈیٹا اور رازداری

source: Clear Tasbeeh History
ar: مسح سجل التسبيح
ur: تسبیح کی ہسٹری صاف کریں

source: Export Progress (PDF)
ar: تصدير التقدم (PDF)
ur: پیش رفت ایکسپورٹ کریں (PDF)

source: Cloud Backup
ar: نسخ احتياطي سحابي
ur: کلاؤڈ بیک اپ

source: App Lock
ar: قفل التطبيق
ur: ایپ لاک

# privacyPolicyTerms
source: Privacy Policy • Terms of Service
ar: سياسة الخصوصية • شروط الخدمة
ur: رازداری کی پالیسی • سروس کی شرائط

# comingSoon
source: {feature} Coming Soon in v2.0!
ar: {feature} قادم قريباً في v2.0!
ur: {feature} ورژن 2.0 میں جلد آرہا ہے!

# notifQuran
source: Quran Reading
ar: قراءة القرآن
ur: تلاوت قرآن

# notifSuhoor
source: Suhoor Meal
ar: وجبة السحور
ur: سحری کا وقت

# notifIftar
source: Iftar Time
ar: وقت الإفطار
ur: افطار کا وقت

# notifTaraweeh
source: Taraweeh Prayer
ar: صلاة التراويح
ur: نماز تراویح

# notifDua
source: Daily Dua
ar: الدعاء اليومي
ur: روزانہ کی دعا

# notifQuote
source: Inspirational Quote
ar: اقتباس ملهم
ur: ایمانی قول

# notifWeekly
source: Weekly Summary
ar: الملخص الأسبوعي
ur: ہفتہ وار جائزہ

source: All progress reset
ar: تم إعادة تعيين كل التقدم
ur: تمام پیش رفت ری سیٹ کر دی گئی

source: Holy Quran
ar: القرآن الكريم
ur: قرآن مجید

# juzCompleted
source: You completed {completed}/{goal} Juz today
ar: أكملت {completed}/{goal} جزء اليوم
ur: آپ نے آج {completed}/{goal} پارے مکمل کیے

# juzAddedTooltip
source: I completed a Juz
ar: أكملت جزءاً
ur: میں نے ایک پارہ مکمل کیا

source: Search surah...
ar: البحث عن سورة...
ur: سورت تلاش کریں...

# allJuz
source: All
ar: الكل
ur: تمام پارے

# juzLabel
source: Juz {number}
ar: الجزء {number}
ur: پارہ {number}

# translationLabel
source: Translation:
ar: الترجمة:
ur: ترجمہ:

# goalLabel
source: Goal: {goal} Juz
ar: الهدف: {goal} جزء
ur: ہدف: {goal} پارے

# versesLabel
source: verses
ar: آيات
ur: آیات

# listenRecitation
source: Listen to Recitation
ar: استمع إلى التلاوة
ur: تلاوت سنیں

source: Daily Quran Goal
ar: هدف القرآن اليومي
ur: قرآن کا روزانہ ہدف

# juzPerDay
source: {count} Juz per day
ar: {count} أجزاء في اليوم
ur: {count} پارے روزانہ

# finishQuran30Days
source: Finish Quran in 30 days
ar: ختم القرآن في 30 يوماً
ur: قرآن 30 دن میں ختم کریں

# finishQuranDays
source: Finish Quran in {days} days
ar: ختم القرآن في {days} يوماً
ur: قرآن {days} دن میں ختم کریں

source: Tasbeeh Counter
ar: عداد التسبيح
ur: تسبیح کاؤنٹر

# counterTab
source: Counter
ar: العداد
ur: کاؤنٹر

# duaListTab
source: Dua List
ar: قائمة الأدعية
ur: دعاؤں کی فہرست

# dayStreakLabel
source: {count} DAY STREAK
ar: تتابع {count} أيام
ur: {count} دن کا تسلسل

# targetLabel
source: TARGET: {target}
ar: الهدف: {target}
ur: ہدف: {target}

# resetCounterTitle
source: Reset Counter?
ar: إعادة تعيين العداد؟
ur: کاؤنٹر ری سیٹ کریں؟

# resetCounterContent
source: This will save your progress to history and reset today's count.
ar: سيؤدي هذا إلى حفظ تقدمك في السجل وإعادة تعيين عداد اليوم.
ur: یہ آپ کی پیش رفت ہسٹری میں محفوظ کرے گا اور آج کا کاؤنٹ ری سیٹ کر دے گا۔

# setTargetTitle
source: Set Target
ar: تحديد الهدف
ur: ہدف مقرر کریں

# dailyGoalLabel
source: Daily Goal
ar: الهدف اليومي
ur: روزانہ کا ہدف

# standardNotificationStyle
source: Standard
ar: قياسي
ur: معیاری

# spiritualNotificationStyle
source: Spiritual Quotes
ar: اقتباسات روحانية
ur: روحانی اقتباسات

# minimalNotificationStyle
source: Minimal
ar: مبسط
ur: مختصر

source: Azan Alarm
ar: تنبيه الأذان
ur: اذان الارم

source: Prayer time notifications
ar: تنبيهات أوقات الصلاة
ur: نماز کے وقت کی اطلاعات

source: Prayer Alarms
ar: تنبيهات الصلاة
ur: نماز کے الارم

source: Azan Sound
ar: صوت الأذان
ur: اذان کی آواز

source: Azan Makkah
ar: أذان مكة
ur: اذان مکہ

source: Azan Madinah
ar: أذان المدينة
ur: اذان مدینہ

# historyCleared
source: History cleared successfully
ar: تم مسح السجل بنجاح
ur: ہسٹری کامیابی سے صاف کر دی گئی

# setPinTitle
source: Set App Lock PIN
ar: تعيين رمز قفل التطبيق
ur: ایپ لاک پن مقرر کریں

# enterPin
source: Enter 4-digit PIN
ar: أدخل رمزاً من 4 أرقام
ur: 4 ہندسوں کا پن درج کریں

source: Confirm PIN
ar: تأكيد الرمز
ur: پن کی تصدیق کریں

# pinMismatch
source: PINs do not match
ar: الرموز غير متطابقة
ur: پن مطابقت نہیں رکھتے

# appLockEnabledToast
source: App Lock Enabled
ar: تم تفعيل قفل التطبيق
ur: ایپ لاک فعال ہو گیا

# appLockDisabledToast
source: App Lock Disabled
ar: تم تعطيل قفل التطبيق
ur: ایپ لاک معطل ہو گیا

source: Meal Planner
ar: مخطط الوجبات
ur: کھانے کا منصوبہ

# waterIntake
source: Water Intake Tracker
ar: تتبع شرب الماء
ur: پانی پینے کا ٹریکر

source: glasses
ar: أكواب
ur: گلاس

source: Remove
ar: إزالة
ur: ختم کریں

source: Add Glass
ar: إضافة كوب
ur: گلاس شامل کریں

# waterGoalReached
source: Daily water goal reached!
ar: تم الوصول لهدف شرب الماء اليومي!
ur: پانی کا روزانہ کا ہدف پورا ہو گیا!

# suhoor
source: Suhoor (Pre-dawn meal)
ar: السحور
ur: سحری

# iftar
source: Iftar (Breaking fast)
ar: الإفطار
ur: افطاری

# healthyTips
source: Healthy Fasting Tips
ar: نصائح لصيام صحي
ur: صحت مند روزے کے مشورے

# suhoorDate
source: Dates
ar: تمر
ur: کھجوریں

# suhoorYogurt
source: Yogurt
ar: زبادي
ur: دہی

# suhoorOats
source: Oats/Porridge
ar: شوفان
ur: دلیا

# suhoorWater
source: Lots of Water
ar: الكثير من الماء
ur: خوب پانی

# iftarDates
source: Dates (Sunnah)
ar: تمر (سنة)
ur: کھجور (سنت)

# iftarWater
source: Water/Juice
ar: ماء / عصير
ur: پانی / جوس

# iftarFruit
source: Fruit Salad
ar: سلطة فواكه
ur: فروٹ چاٹ

# iftarLight
source: Light Soup
ar: شوربة خفيفة
ur: ہلکا سوپ

# suhoorDates
source: Dates (3–5)
ar: تمر (3-5 حبّات)
ur: کھجوریں (3 سے 5)

# suhoorWaterItem
source: Water (large glass)
ar: ماء (كوب كبير)
ur: پانی (بڑا گلاس)

# suhoorEggs
source: Eggs (boiled or scrambled)
ar: بيض (مسلوق أو مقلي)
ur: انڈے (ابلے ہوئے یا آملیٹ)

# suhoorOatsItem
source: Oatmeal with honey
ar: شوفان بالعسل
ur: شہد والا دلیا

# suhoorBread
source: Whole wheat bread
ar: خبز القمح الكامل
ur: گندم کی روٹی

# suhoorYogurtItem
source: Yogurt / Lassi
ar: زبادي / لبن
ur: دہی / لسی

# suhoorFruits
source: Fruits (banana, apple)
ar: فواكه (موز، تفاح)
ur: پھل (کیلا، سیب)

# suhoorNuts
source: Nuts (almonds, walnuts)
ar: مكسرات (لوز، جوز)
ur: نمیات (بادام، اخروٹ)

# iftarBreakDates
source: Break fast with dates
ar: الإفطار على التمر
ur: کھجور سے روزہ کھولیں

# iftarWaterItem
source: Water (2+ glasses)
ar: ماء (كوبان فأكثر)
ur: پانی (2+ گلاس)

# iftarFruitSalad
source: Fruit salad
ar: سلطة فواكه
ur: فروٹ چاٹ

# iftarShorba
source: Shorba (soup)
ar: شوربة
ur: شوربہ / سوپ

# iftarProtein
source: Light protein
ar: بروتين خفيف
ur: ہلکی پروٹین

# iftarSalad
source: Salad / veggies
ar: سلطة / خضروات
ur: سلاد / سبزیاں

# iftarRiceBread
source: Rice or bread (moderate)
ar: أرز أو خبز (باعتدال)
ur: چاول یا روٹی (اوسط مقدار)

# iftarAvoidFried
source: Avoid fried foods
ar: تجنب الأطعمة المقلية
ur: تلی ہوئی چیزوں سے پرہیز کریں

# tipWater
source: Drink 8 glasses of water between Iftar and Suhoor
ar: اشرب 8 أكواب من الماء بين الإفطار والسحور
ur: افطار اور سحری کے درمیان 8 گلاس پانی پییں

# tipAvoidSalty
source: Avoid salty, spicy, and fried foods – they increase thirst
ar: تجنب الأطعمة المالحة والحارة والمقلية - فهي تزيد من العطش
ur: نمکین، مسالیدار اور تلی ہوئی چیزوں سے پرہیز کریں - یہ پیاس بڑھاتی ہیں

# tipLateSuhoor
source: Eat suhoor as late as possible before Fajr
ar: تناول السحور في وقت متأخر قدر الإمكان قبل الفجر
ur: سحری فجر سے جتنا ممکن ہو دیر سے کھائیں

# tipSlowIftar
source: Don't overeat at Iftar - eat slowly and mindfully
ar: لا تفرط في الأكل عند الإفطار - كل ببطء وبوعي
ur: افطار میں زیادہ نہ کھائیں - آرام سے اور توجہ سے کھائیں

# tipExercise
source: Light exercise after Taraweeh is great for digestion
ar: ممارسة تمارين خفيفة بعد التراويح مفيدة للهضم
ur: تراویح کے بعد ہلکی ورزش ہاضمے کے لیے بہترین ہے

# tipSleep
source: Sleep 6–8 hours – rest is part of ibadah
ar: النوم لمدة 6-8 ساعات - الراحة جزء من العبادة
ur: 6 سے 8 گھنٹے سوئیں - آرام بھی عبادت کا حصہ ہے

# tipNoCaffeine
source: Avoid caffeinated drinks that cause dehydration
ar: تجنب المشروبات التي تحتوي على الكافيين لأنها تسبب الجفاف
ur: کیفین والے مشروبات سے پرہیز کریں جو پانی کی کمی کا سبب بنتے ہیں

# tipHealthyFood
source: Prioritize fruits, vegetables, and complex carbs
ar: إعطاء الأولوية للفواكه والخضروات والكربوهيدرات المعقدة
ur: پھلوں، سبزیوں اور پیچیدہ کاربوہائیڈریٹس کو ترجیح دیں

source: verses
ar: آيات
ur: آیات

source: Loading ayahs...
ar: جاري تحميل الآيات...
ur: آیات لوڈ ہو رہی ہیں...

# failedLoadInternet
source: Failed to load. Check internet.
ar: فشل التحميل. تحقق من الإنترنت.
ur: لوڈ کرنے میں ناکامی۔ انٹرنیٹ چیک کریں۔

# noInternet
source: No internet connection.
ar: لا يتوفر اتصال بالإنترنت.
ur: انٹرنیٹ کنکشن نہیں ہے۔

source: Retry
ar: إعادة المحاولة
ur: دوبارہ کوشش کریں

source: Remove bookmark
ar: إزالة العلامة
ur: بک مارک ختم کریں

# addBookmark
source: Bookmark
ar: إضافة علامة
ur: بک مارک کریں

# rateApp
source: Rate the App
ar: قيم التطبيق
ur: ایپ کی درجہ بندی کریں

# shareApp
source: Share with Friends
ar: شارك مع الأصدقاء
ur: دوستوں کے ساتھ شیئر کریں

source: Contact Support
ar: الاتصال بالدعم
ur: سپورٹ سے رابطہ کریں

source: Terms of Service
ar: شروط الخدمة
ur: سروس کی شرائط
